package main

import (
	"fmt"
	"sync"
)

// 10 000
// var number int = 0

// атомики - это примитивы синхронизации, которые позволяют безопасно изменять переменные в конкурентной среде без использования мьютексов.
// атомики - это переменные, работа с которыми отдельно вынесена в процессоре в отдельные модули, благодаря чему у нас увеличение переменной на какое-то число
// является не многосоставной операцией, а односоставной.
// атомики занимают больше процессорного времени, чем обычные переменные,
// но зато они позволяют безопасно изменять переменные в конкурентной среде без использования мьютексов.
// var number atomic.Int64

var slice []int

// мьютекс - это примитив синхронизации, который позволяет безопасно изменять переменные в конкурентной среде.
// мьютекс - это переменная, которая может быть заблокирована и разблокирована.
// мьютекс позволяет безопасно изменять переменные в конкурентной среде, но при этом он занимает меньше процессорного времени, чем атомики.

var mtx sync.Mutex

func increase(wg *sync.WaitGroup) {
	defer wg.Done()

	for i := 1; i <= 1000; i++ {
		//number++
		// number.Add(1) // за один непрерывный шаг увеличиваем переменную на 1, в отличие от обычного увеличения переменной, которое является многосоставной операцией

		// критическая секция - это участок кода, который может быть выполнен только одним потоком в один момент времени.
		mtx.Lock()
		slice = append(slice, i)
		mtx.Unlock()
	}
}

func main() {
	wg := &sync.WaitGroup{}
	wg.Add(10)

	go increase(wg)
	go increase(wg)
	go increase(wg)
	go increase(wg)
	go increase(wg)

	go increase(wg)
	go increase(wg)
	go increase(wg)
	go increase(wg)
	go increase(wg)

	wg.Wait()

	// fmt.Println("number:", number.Load())

	// такое правило - блокировать и разблокировать вывод, т.к. если у нас имеется конкурентный доступ к какой-то переменной, то нам нужно его обкладывать мьютексами для избежания гонки данных.
	mtx.Lock()
	fmt.Println("slice len:", len(slice))
	mtx.Unlock()
}
