package main

import (
	"fmt"
	"sync"
	"time"
)

func postman(wg *sync.WaitGroup, text string) { // (text string, ch chan int, wg *sync.WaitGroup)
	defer wg.Done() // 2) лучше так сразу вызывать, это гарантирует, что он всегда отработает при завершении горутины

	for i := 1; i <= 3; i++ {
		fmt.Println("Я почтальон, я отнёс газету", text, "a", i, "раз")
		time.Sleep(250 * time.Microsecond)
	}

	// 1) wg.Done() // Отрабатывает счётчик: у нас 3 горутины, код отрабатывает до вг.Дан: было 3, стало 2, и так далее до нуля, потом код завершается, выходя из вг.Вейт в "main завершился"
}

func main() {
	// Вейтгруппа - это примитив синхронизации, располагающийся в пакете "sync"
	// Когда создаем канал через make, то под капотом у нас возвращается указатель на созданную структуру,
	// поэтому когда мы следующим образом внутрь функции передаем канал, то на самом деле мы передаем его по указателю
	// wg := sync.WaitGroup{}

	// go postman(&wg, "Новости")
	// go postman(&wg, "Игровой журнал")
	// go postman(&wg, "Автомобильная хроника")

	wg := &sync.WaitGroup{}

	wg.Add(1) // Лучше сразу ставить перед горутиной сколько раз мы ее запустим прямо перед запуском, нежели перед всеми сразу общее количество
	go postman(wg, "Новости")

	wg.Add(1)
	go postman(wg, "Игровой журнал")

	wg.Add(1)
	go postman(wg, "Автомобильная хроника")

	wg.Wait()

	fmt.Println("main завершился!")
}
