package main

// - Опишите функцию, которая генерирует одно случайное число,
// после чего пишет это число в переданный ей канал
// - Запустите описанную функцию сразу в нескольких горутинах,
// после чего в Main функции прочитайте все значения, приходящие в канал
// - Выведите все полученные значения на экран
// - Убедитесь. что все горутины передали свои значения,
// и что в Main горутине все эти значения были прочитаны

import (
	"fmt"
	"math/rand"
)

// функция, которая генерирует одно случайное число и записывает его в канал
func randomNumber(ch chan int) {
	ch <- rand.Intn(100) // ch <- rand.Intn(100) - записываем случайное число от 0 до ∞
}

func main() {
	ch := make(chan int) // создаём канал для передачи случайных чисел

	// запускаем функцию генерации одного случайного числа сразу в нескольких горутинах
	go randomNumber(ch)
	go randomNumber(ch)
	go randomNumber(ch)

	// читаем все значения, приходящие в канал, и выводим их на экран
	rn1 := <-ch
	fmt.Println(rn1)
	rn2 := <-ch
	fmt.Println(rn2)
	rn3 := <-ch
	fmt.Println(rn3)

	// четвертый запуск покажет панику (дедлок), так как канал не буферизированный, и в него никто не пишет
	// rn4 := <-ch
	// fmt.Println(rn4)

	// пример с буферизированным каналом, который позволяет избежать дедлока
	// ch := make(chan int, 3) // создаём буферизированный канал для передачи случайных чисел

	// пример с запуском определённого количества горутин с помощью цикла,
	// и чтением всех значений, записанных в слайсе
	// func main() {
	//     const count = 3
	//     ch := make(chan int)

	//     for i := 0; i < count; i++ {
	//         go randomNumber(ch)
	//     }

	//     numbers := make([]int, 0, count) // []int — тип слайса, 0 — его начальная длина
	// // (пока элементов нет), count — вместимость. Дальше append добавляет числа
	//     for i := 0; i < count; i++ {
	//         numbers = append(numbers, <-ch)
	//     }

	//     fmt.Println(numbers)
	// }

}
