package main

// - Опишите функцию, которая принимает целое число (свой номер), после чего 5 раз,
// с интервалом в одну секунду, выводит на экран:
// - "Я горутина N, делаю вывод на экран в X раз", где N - номер горутины,
// а Х - номер итерации
//  Запустите 3 горутины, в каждой горутине запущена вышеописанная функция
// Посмотрите на вывод в консоли, объясните себе его, оцените,
// насколько этот вывод соответствует вашим ожиданиям

import (
	"fmt"
	"time"
)

func acceptNumber(n int) {
	// n - номер горутины (N); i - номер итерации (X)
	for i := 1; i < 6; i++ { // i := range 5
		fmt.Printf("Я горутина %d, делаю вывод на экран в %d раз\n", n, i) // fmt.Println("Я горутина &d", n, ", делаю вывод на экран в", i, "раз")
		time.Sleep(1 * time.Second)
	}
}

func main() {
	// запускаем 3 горутины, в каждой из которых выполняется функция acceptNumber
	go acceptNumber(1)
	go acceptNumber(2)
	go acceptNumber(3)

	time.Sleep(6 * time.Second) // чтобы горутины успели завершить работу, иначе программа завершится раньше
}
