package main

import (
	"fmt"
	"math/rand"
	"time"
)

/*
- запустите 2 горутины через анонимные функции.
- каждая горутина принимает свой отдельный канал, и в самом начале своего выполнения
 спит случайное количество времени.
 (100ms, 200ms, 300ms, 400ms, 500ms, 600ms, 700ms, 800ms, 900ms, 1000ms),
 это сгенерированное количество времени нужно вывести на экран,
 после чего горутина пишет случайное значение в переданный канал.
- после запуска этих двух горутин, main горутина засыпает на 500ms, после чего доходит
 до блока select, в котором ожидаются значения из двух каналов, переданных в горутины,
 и секция default.
Каждая секция, будь то вычитывание значения из канала или же секция default, должны
 выводить на экран информацию о том, какая именно секция отработала и какие значения
приняла (если вообще приняла).
- оценить консольный вывод, объяснить его самому себе, сравнить с ожиданиями.
- поиграться с временем засыпания горутин, попробовать поставить фиксированное время
сна до записи в канал, увидеть как это влияет на результат и объяснить себе почему.
*/

func main() {
	/*
		- каждая горутина принимает свой отдельный канал, и в самом начале своего выполнения
		 спит случайное количество времени.
		 (100ms, 200ms, 300ms, 400ms, 500ms, 600ms, 700ms, 800ms, 900ms, 1000ms),
		 это сгенерированное количество времени нужно вывести на экран,
		 после чего горутина пишет случайное значение в переданный канал.
	*/

	ch1 := make(chan int)
	ch2 := make(chan int)

	delays := []time.Duration{
		100 * time.Millisecond,
		200 * time.Millisecond,
		300 * time.Millisecond,
		400 * time.Millisecond,
		500 * time.Millisecond,
		600 * time.Millisecond,
		700 * time.Millisecond,
		800 * time.Millisecond,
		900 * time.Millisecond,
		1000 * time.Millisecond,
	}

	/*
		- запустите 2 горутины через анонимные функции.
	*/

	/*
		ch - имя параметра внутри анонимной горутины,
		chan int - тип параметра: канал, через который передаются значения типа int,
		ch1 - аргумент после тела функции, который передаётся парамтеру ch при запуске
		горутины, здесь это канал, созданный ранее через ch1 := make(chan int).
	*/

	go func(ch chan int) {
		delay := delays[rand.Intn(len(delays))]
		time.Sleep(delay)
		fmt.Println("Задержка №1:", delay)
		ch <- rand.Intn(100) // отправить число в канал ch, то есть в ch1
	}(ch1)

	go func(ch chan int) {
		delay := delays[rand.Intn(len(delays))]
		time.Sleep(delay)
		fmt.Println("Задержка №2:", delay)
		ch <- rand.Intn(100)
	}(ch2)

	/*
		- после запуска этих двух горутин, main горутина засыпает на 500ms, после чего доходит
		 до блока select, в котором ожидаются значения из двух каналов, переданных в горутины,
		 и секция default.
		 Каждая секция, будь то вычитывание значения из канала или же секция default,
		 должны выводить на экран информацию о том, какая именно секция отработала
		 и какие значения приняла (если вообще приняла)
	*/

	time.Sleep(500 * time.Millisecond)

	select {
	case value := <-ch1:
		fmt.Println("Значение №1:", value)
	case value := <-ch2:
		fmt.Println("Значение №2:", value)
	default:
		fmt.Println("Значения пока нет")
	}

	/*
		go func() {
			delay := delays[rand.Intn(len(delays))]
			time.Sleep(delay)
			fmt.Println("Задержка №1:", delay)

			ch1 <- rand.Intn(100)
		}()

		go func() {
			delay := delays[rand.Intn(len(delays))]
			time.Sleep(delay)
			fmt.Println("Задержка №2:", delay)

			ch2 <- rand.Intn(100)
		}()

		value1 := <-ch1
		fmt.Println("Случайное значение №1:", value1)
		value2 := <-ch2
		fmt.Println("Случайное значение №2:", value2)
	*/
}
