package main

import (
	"fmt"
	"math/rand"
	"time"
)

/*
- пусть у нас есть интервьюер, который ходит по заданному району
и собирает у людей мнения о новом законопроекте.
- интервьюер заранее не знает, сколько людей он повстречает и сколько мнений сможет собрать.
эта случайность иммитируется при помощи рандомно сгенерированного числа, назовём это число N.
- со случайным интервалом (от 300ms до 700ms) интервьюер будет находить одного из N жителей,
получать от него мнение (пусть мнение == случайно сгенерированная строка из 5-ти символов),
после чего передавать это мнение в строковый канал.
- main горутина должна вычитать все мнения людей, которые собрал интервьюер,
после чего завершиться.
*/

// создам структуру для удобного отображения мнений людей и затрачиваемого времени на их сбор
// структура - контейнер с данными, которые из разных типов, объединённые в один объект для последующей передачи в канал
type collectedOpinion struct {
	text     string        // мнение человека
	duration time.Duration // затраченное время на сбор мнения
}

// ...пусть мнение == случайно сгенерированная строка из 5-ти символов
func randomOpinion() string {
	// генерируем случайное мнение из 5-ти символов
	opinion := make([]byte, 5) // создаём слайс из 5 байтов, место для хранения пяти символов
	for i := range opinion {   // 0, 1, 2, 3, 4
		opinion[i] = byte(rand.Intn(26) + 97) // генерируем случайный символ от 'a' до 'z'
	}
	return string(opinion) // преобразовываем слайс байтов в строчный слайс и возвращаем его
}

/*
- пусть у нас есть интервьюер, который ходит по заданному району
и собирает у людей мнения о новом законопроекте.
*/
func interviewer(ch chan collectedOpinion) { // func interviewer(ch chan string) {
	// дефёр ставим в начале функции, чтобы гарантированно закрыть канал после того,
	// как интервьюер закончит собирать мнения людей
	defer close(ch) // закрываем канал после того, как интервьюер закончит собирать мнения людей

	/*
		- интервьюер заранее не знает, сколько людей он повстречает
		и сколько мнений сможет собрать.
		эта случайность иммитируется при помощи рандомно сгенерированного числа,
		назовём это число N.
	*/
	N := rand.Intn(10) + 1 // генерируем случайное число от 1 до 10, которое будет количеством жителей
	// fmt.Println(N)

	for range N {
		delay := time.Duration(rand.Intn(401)+300) * time.Millisecond // rand.Intn(400) + 300 генерируем случайное число от 300 до 699, поэтому делаем rand.Intn(401) + 300
		time.Sleep(delay)                                             // иммитируем случайный интервал от 300ms до 700ms, за который интервьюер находит одного из N жителей
		// ch <- randomOpinion() // передаём сгенерированное случайные мнения случайного количество людей в канал
		ch <- collectedOpinion{ // передаём сгенерированное случайные мнения случайного количество людей в канал и время на их сбор
			text:     randomOpinion(), // создаем значение мнения структуры collectedOpinion
			duration: delay,           // создаем значение затрачиваемого времени на сбор мнения структуры collectedOpinion
		}
	}
}

func main() {
	ch := make(chan collectedOpinion) // создаём канал для передачи мнений людей
	go interviewer(ch)                // запускаем горутину интервьюера, который будет собирать мнения людей (и фиксировать затраченное время на сбор каждого отдельного мнения) и передавать их в общий канал мнений
	for opinion := range ch {         // в main горутине вычитываем все мнения людей, которые собрал интервьюер, после чего main завершится
		// fmt.Println(opinion)
		fmt.Printf("%s: %s\n", opinion.text, opinion.duration) // выводим мнение человека и затраченное время на сбор мнения
	}
}
